Ext.define('EVEInDust.Application', {
    extend: 'Ext.app.Application',
    
    name: 'EVEInDust',
    requires: [
        'Ext.grid.Panel',
        "EVEInDust.eveoj.SDD"
    ],

    stores: [
        'TradeHubs',
        "OrderStatuses"
    ],
    launch: function(){
        EVEInDust.eveoj.SDD.initSSDInstance('http://cf.xyjax.com/sdd/101505',function(){
            var invTypesTable = EVEInDust.eveoj.SDD.getInvTypesTable(),
                i, row, groups, groupsAssoc = {},
                data = []
            ;
            // я знаю, что это ужасный способ, но пока так
            groups = [25, 26, 27, 28, 29, 30, 31, 237, 324, 358, 380, 381, 419, 420, 463, 485, 513, 540, 541, 543, 547, 659, 830, 831, 832, 833, 834, 883, 893, 894, 898, 900, 902, 906, 941, 963, 1022, 1201, 1202, 1283, 38, 39, 40, 41, 43, 46, 47, 48, 49, 52, 53, 54, 55, 56, 57, 59, 60, 61, 62, 63, 65, 67, 68, 71, 72, 74, 76, 77, 78, 80, 82, 96, 98, 201, 202, 203, 205, 208, 209, 210, 211, 212, 213, 225, 285, 289, 290, 291, 295, 302, 308, 309, 315, 316, 317, 321, 325, 326, 328, 329, 330, 338, 339, 341, 353, 357, 367, 378, 379, 405, 406, 407, 464, 472, 475, 481, 483, 499, 501, 506, 507, 508, 509, 510, 511, 512, 514, 515, 518, 524, 538, 546, 585, 586, 588, 589, 590, 638, 642, 644, 645, 646, 647, 650, 658, 660, 737, 753, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771, 773, 774, 775, 776, 777, 778, 779, 781, 782, 786, 815, 842, 862, 878, 896, 899, 901, 904, 905, 1122, 1150, 1154, 1156, 1189, 1199, 1223, 1226, 1232, 1233, 1234, 1238, 1245, 1289, 1292, 1299, 83, 85, 86, 87, 88, 89, 90, 92, 372, 373, 374, 375, 376, 377, 384, 385, 386, 387, 394, 395, 396, 425, 476, 479, 482, 492, 497, 498, 500, 548, 648, 653, 654, 655, 656, 657, 663, 772, 863, 864, 892, 907, 908, 909, 910, 911, 916, 972, 1010, 1019, 1153, 1158, 97, 100, 101, 299, 470, 544, 545, 549, 639, 640, 641, 1023, 1159, 361, 1149, 1246, 1247, 1249, 1250, 1273, 1274, 1275, 1276, 311, 363, 364, 365, 397, 404, 413, 414, 416, 417, 418, 426, 430, 438, 439, 440, 441, 443, 444, 445, 449, 471, 473, 480, 707, 709, 710, 837, 838, 839, 840, 877, 1212, 1282];
            for(i =0; i<groups.length; i++){
                groupsAssoc[groups[i]] = true;
            }
            for(i in invTypesTable.data) {
                if(invTypesTable.data.hasOwnProperty(i)) {
                    row = invTypesTable.data[i];
                    if( groupsAssoc[+row[invTypesTable.c.groupID]]) {
                        data.push([row[invTypesTable.c.typeID], row[invTypesTable.c.typeName]]);
                    }
                }
            }
            Ext.create("Ext.data.ArrayStore",{
                fields: [
                    { name: "typeId", type: "int"},
                    { name: "typeName", type: "string"}
                ],
                data: data,
                storeId: "eveoj.InvTypes"
            });
        });
    }
});
